Repository: igorseabra4/HeavyModManager
Catalog: HeavyModManager/Forms/GlobalResources.*.resx
Languages: de, pt

# bfbbName
source: SpongeBob SquarePants: Battle for Bikini Bottom
de: SpongeBob Schwammkopf: Schlacht um Bikini Bottom

# bttmName
source: Family Guy: Back to the Multiverse
de: Family Guy: Zurück ins Multiversum

# rotuName
source: The Incredibles: Rise of the Underminer
de: Die Unglaublichen: Der Angriff des Tunnelgräbers

# scoobyName
source: Scooby-Doo: Night of 100 Frights
de: Scooby-Doo: Nacht der 100 Schrecken

# tosName
source: SpongeBob's Truth or Square
de: SpongeBob's Eiskalt Entwischt

# tssmName
source: The SpongeBob SquarePants Movie
de: Der SpongeBob Schwammkopf Film

# upName
source: Up
de: Oben

# wallEName
source: WALL-E
de: WALL-E: Der Letzte räumt die Erde auf

# confirmDeleteMod
source: Are you sure you want to delete "{0}" by {1}?
de: Sind Sie sicher, dass Sie den Mod "{0}" von {1} löschen möchten?
pt: Você tem certeza que quer remover o mod "{0}" por {1}?

source: Developer Mode
de: Entwickler Modus
pt: Modo Desenvolvedor

# dolphinNotFoundLabel
source: Dolphin executable not found on set path.
de: Die ausführbare Dolphin Datei wurde im festgelegten Pfad nicht gefunden.
pt: Executável Dolphin não encontrado no caminho definido.

# dolphinPathNotSetLabel
source: Dolphin executable path not set.
de: Der Pfad für die ausführbare Dolphin Datei ist nicht festgelegt.
pt: Caminho do executável do Dolphin não definido.

# dolphinPathNotSetTooltip
source: Dolphin executable path not set. Please click on Settings > Choose Dolphin Path... and select the Dolphin executable. Selecting a shortcut is also possible.
de: Der Pfad für die ausführbare Dolphin Datei ist nicht festgelegt. Klicke auf Einstellungen -> Ausführbare Dolphin Datei auswählen... und wähle die Dolphin.exe aus. Auch die Auswahl einer Verknüpfung ist möglich.
pt: Caminho do executável do Dolphin não definido. Clique em Configurações > Escolher caminho do Dolphin... e selecione o executável do Dolphin. Também é possível selecionar um atalho.

source: Dolphin User Folder:
de: Dolphin Benutzerordner:
pt: Pasta de usuário do Dolphin:

# dolphinUserFolderPathNotSetLabel
source: Dolphin user folder path not set.
de: Der Pfad zum Dolphin Benutzerordner ist nicht festgelegt.
pt: Caminho da pasta do usuário do Dolphin não definido.

# dolphinUserFolderPathNotSetTooltip
source: Dolphin user folder path not set. Please click on Settings > Choose Dolphin User Folder Path... and select the Dolphin user folder. It is usually located in "AppData" (for newer installs), or "Documents\Dolphin Emulator". To find it, you can open Dolphin and select File > Open User Folder.
de: Wählen Sie den Dolphin Benutzerordner Pfad… Klicke auf Einstellungen -> Dolphin Benutzerorder auswählen... Es befindet sich normalerweise unter "AppData" oder "Documents\Dolphin Emulator".
pt: Caminho da pasta de usuário do Dolphin não definido. Clique em Configurações > Escolher Caminho da Pasta de Usuário do Dolphin... e selecione a pasta de usuário do Dolphin. Ela geralmente está localizada em "AppData" (para instalações mais recentes) ou em "Documentos\Dolphin Emulator". Para encontrá-la, abra o Dolphin e selecione Arquivo > Abrir Pasta de Usuário.

# dolphinUserPathNotFoundLabel
source: Dolphin user folder not found on set path.
de: Der Pfad zum Dolphin Benutzerordner ist nicht festgelegt.
pt: Pasta de usuário do Dolphin não encontrada no caminho definido.

source: Error
de: Fehler
pt: Erro

source: ISO or main.dol
de: ISO oder main.dol
pt: ISO ou main.dol

# noModsTooltip
source: You do not have mods for this game. Please click on "Add Mods" and select a mod ZIP file.
de: Es existieren keine Mods für dieses Spiel. Klicke auf "Mods hinzufügen" und wähle eine Mod-Zip-Datei aus.
pt: Você não possui mods para este jogo. Clique em "Adicionar Mods" e selecione um arquivo ZIP de mod.

# noBackupTooltip
source: You do not have a backup for this game. Please click on "Create Backup" and select the game's ISO file.
de: Es existiert kein Backup für dieses Spiel. Klicke auf "Backup erstellen" und wähle die ISO des Spiels.
pt: Você não possui um backup para este jogo. Clique em "Criar Backup" e selecione o arquivo ISO do jogo.

source: Unsupported file type.
de: Nicht unterstütztes Dateiformat.
pt: Tipo de arquivo não suportado.

# selectGameTitle
source: Please select your game's ISO or the main.dol from an unchanged Dolphin dump.
de: Bitte wählen Sie die ISO Ihres Spiels oder main.dol aus einem unveränderten Dolphin-Dump aus.
pt: Selecione o ISO do seu jogo ou o main.dol de um dump do Dolphin inalterado.

# DolPatchesInfo
source: Enter patches to be applied to the game's DOL file, in the form of <offset> <value>, both 4-byte hexadecimal numbers, one per line. You can add comments after #s. Example: 00287D10 53494D50 00287DB0 54455854 # This is a comment #another comment Supported games: Scooby, BFBB, Movie, Incredibles, Underminer, RatProto
de: Patches die auf die ausführbare DOL-Datei angewendet werden sollen. Diese ersetzen eine vierstellige Byte Zahl unter dem angegebenen Offset. Format: <offset> <value>, jeweils eine pro Zeile. Kommentare können mit einem # hinzugefügt werden. Beispiel: 00287D10 53494D50 00287DB0 54455854 # Dies ist ein Kommentar # Weiterer Kommentar Unterstützte Spiele: Scooby, BFBB, Movie, Incredibles, Underminer, RatProto

source: Edit Mod
de: Mod bearbeiten
pt: Editar mod

# gameIdInfo
source: Enter a custom game ID for the mod. Save files are created using this game ID, enabling your mod to have a unique save file. Make sure no other GameCube or Wii game has the same ID. It is recommended to keep the first four characters the same and change only the last two. Must be 6 characters long. Leave blank for default. Supported games: Scooby, BFBB, Movie, Incredibles, Underminer
de: Geben Sie eine benutzerdefinierte Spiel-ID für den Mod ein. Mit dieser Spiel-ID werden Speicherdateien erstellt, sodass Ihr Mod über eine einmalige Speicherdatei verfügt. Stellen Sie sicher, dass kein anderes GameCube- oder Wii-Spiel dieselbe ID hat. Es wird empfohlen, die ersten vier Zeichen beizubehalten und nur die letzten beiden zu ändern. Muss 6 Zeichen lang sein. Für die Standardeinstellung leer lassen.

# iniNotFoundTitle
source: INI not found in files
de: INI nicht in Dateien gefunden
pt: INI não encontrado nos arquivos

# IniValuesInfo
source: Enter the game's configuration INI key-value pairs for this mod, in the form of <key>=<value>, one per line. You can add comments after #s. You only need to enter the lines needed by your mod. Example: BOOT=HB00 ShowMenuOnBoot=0 # This is a comment G.BubbleBowl=1 #another comment On an already existing mod, click on 'Import' to import the mod's INI into here. Only modified values will be imported and the file itself will be deleted. A few types of key are special because they can appear multiple times in the INI: - ScenePlayerMapping, ThresholdPointsRange and AlternateCostumeMapping: will replace values based on the stage ID name (first 4 characters of the value) - TaskStatus and Extra: if present, will replace ALL entries, so if you're replacing those, you must enter all of them. If you're still unsure how to use these keys, create your INI file manually, then use Import. The tool will import the values exactly as they are needed. Supported games: Scooby, BFBB, Movie, Incredibles, Underminer, RatProto
de: INI Einstellungen für diese Mod, im Format <key>=<wert>, jeweils eine pro Zeile. Kommentare können nach ein # hinzugefügt werden. Es müssen nur Einstellungen hinzugefügt werden, die von der Mod benötigt werden. Beispiel: BOOT=HB00 ShowMenuOnBoot=0 # Dies ist ein Kommentar G.BubbleBowl=1 # Weiterer Kommentar Bei bereits existierenden Mods, klicke auf "Importieren", um die INI-Datei der Mod hinzuzufügen. Nur modifizierte Einstellungen werden übernommen und die Datei selbst wird gelöscht. Einige Einstellungen sind besonders: - ScenePlayerMapping, ThresholdPointsRange und AlternateCostumeMapping: Werte werden basierend auf deren vierstelligen Levelcode (BB01, B101 etc.) ersetzt. - TaskStatus und Extra: Falls angegeben, ersetzt alle vorhandenen Werte. Wenn du eins dieser beiden Einstellungen hinzufügst, musst du die restlichen fehlenden angeben. Falls du dir immer noch unsicher bist, erstelle die INI-Datei manuell und klicke auf "Importieren". Das Tool importiert die Werte automatisch. Unterstützte Spiele: Scooby, BFBB, Movie, Incredibles, Underminer, RatProto

# mergeHipsInfo
source: Enter your mod's HIP and HOP files which should be merged into the running copy of the game instead of replacing the original ones, one per line. Assets from the mod will be imported into the destination archive, replacing any assets with the same asset ID if they exist. Assets of certain types will be merged into one (namely: Collision Table, Jaw Data Table, Level of Detail Table, Pipe Info Table, Shadow Table and Sound Info. Example: boot.HIP hb/hb01.HOP mn/mn04.HIP Supported games: Scooby, BFBB, Movie, Incredibles, Underminer, RatProto
de: HIP- und HOP-Dateien der Mod, die in die Kopie des Spiels eingefügt werden sollen, anstatt die Originaldateien zu ersetzen, jeweils eine pro Zeile. Assets aus dem Mod werden in das Zielarchiv importiert und ersetzen dabei vorhandene Assets mit derselben Asset-ID, falls diese existieren. Assets bestimmter Typen werden nicht ersetzt, sondern zusammengeführt: Collision Table, Jaw Data Table, Level of Detail Table, Pipe Info Table, Shadow Table und Sound Info.

source: Mod Created
de: Mod erstellt
pt: Mod criado

source: Mod created at
de: Mod erstellt in
pt: Mod criado em

# modIdAlreadyExists
source: Unable to Create Mod: a mod with the same ID already exists.
de: Mod kann nicht erstellt werden: Es existiert bereits eine Mod mit derselben ID.
pt: Não foi possível criar um mod: já existe um mod com o mesmo ID.

# modIdInfo
source: The Mod ID is generated automatically from the game name, author and mod name. Feel free to enter your own custom ID for the mod, but make sure that it's unique! No other mod, by any other author or for any other game, should have the same ID as yours. The Mod ID cannot be changed after the mod is created.
de: Die Mod-ID wird automatisch aus dem Spielnamen, Autor und Mod-Name generiert. Es ist auch möglich eine eigene benutzerdefinierte ID einzugeben, solange diese nicht in Konflikt mit bereits existierenden Mods steht. Stelle also sicher, dass die Mod-ID einzigartig ist. Die Mod-ID kann nach der Erstellung der Mod nicht mehr geändert werden.
pt: O ID do Mod é gerado automaticamente a partir do nome do jogo, autor e nome do mod. Sinta-se à vontade para inserir seu próprio ID personalizado para o mod, mas certifique-se de que seja único! Nenhum outro mod, de qualquer outro autor ou para qualquer outro jogo, deve ter o mesmo ID que o seu. O ID do Mod não pode ser alterado após a criação do mod.

source: Save
de: Speichern
pt: Salvar

# removeFilesInfo
source: Enter the folders or files present in the original game which should be deleted from the mod, one per line. Example: boot.HIP hb\hb01.HOP mn\mn04.HIP Supported games: Scooby, BFBB, Movie, Incredibles, Underminer, RatProto
de: Ordner und Dateien des Originalspiels, die aus der Mod entfernt werden sollen, jeweils eine pro Zeile. Beispiel: boot.HIP hb\\hb01.HOP mn\\mn04.HIP Unterstützte Spiele: Scooby, BFBB, Movie, Incredibles, Underminer, RatProto

# showCodesInfo
source: codes to be applied by Dolphin. Format should be similar to Dolphin Settings: Each code starts with <code name>, then each line follows the format <offset> <value>, both 4-byte hexadecimal numbers. You can add comments after *s. Example: $Blue Box Fix 043CD04C 00000000 *This is a comment $Warp Anywhere 040BC1C8 38000001 040BC258 38000001 040BC300 38000001 *another comment Supported games: Scooby, BFBB, Movie, Incredibles, Underminer, RatProto
de: codes, die in Dolphin angewendet werden sollen. Format ähnelt den Dolphin Einstellungen. Codes starten wie folgt: $<code name>, jede weitere Zeile folgt dem Format <offset> <value>, wovon beide jeweils eine vierstellige Hexadezimalzahl beinhalten. Kommentare können mit einem * hinzugefügt werden. Beispiel: $Blue Box Fix 043CD04C 00000000 * Dies ist ein Kommentar $Warp Anywhere 040BC1C8 38000001 040BC258 38000001 040BC300 38000001 * Weiterer Kommentar Unterstützte Spiele: Scooby, BFBB, Movie, Incredibles, Underminer, RatProto

source: Unable to Create Mod
de: Mod kann nicht erstellt werden
pt: Não é possível criar o mod

# incrediblesName
source: The Incredibles
de: Die Unglaublichen

# createModText
source: &Create Mod...
de: Mod &erstellen…
pt: &Criar mod...

# editModText
source: &Edit Mod...
de: Mod &bearbeiten…
pt: &Editar mod...

# openModFolderText
source: &Open Mod Folder...
de: Mod &Ordner öffnen…
pt: &Abrir pasta do mod...

# deleteModText
source: &Delete Mod...
de: Mod &löschen…
pt: &Remover mod...

# labelDefaultGameIdText
source: Default Game ID
de: Standard Game ID
pt: Game ID Padrão

# updateAvailable
source: There is an update available:
pt: Há uma atualização disponível:

# updateAvailableTitle
source: Update Available
pt: Atualização Disponível

# confirmDeleteModTitle
source: Delete mod
pt: Remover mod

# errorCreatingModZip
source: There was an error creating your mod ZIP archive:
pt: Ocorreu um erro ao criar o arquivo ZIP do seu mod:

# downloadPrompt
source: Do you wish to download it?
pt: Deseja realizar o download?

# errorCheckingForUpdates
source: There was an error checking for updates:
pt: Ocorreu um erro ao verificar atualizações:

# errorCheckingForUpdatesTitle
source: Error Checking for Updates
pt: Erro ao verificar atualizações

# iniErrorGameBackupNotFound
source: Unable to import INI: game backup not found. Please create a backup from the original game's ISO file.
pt: Não foi possível importar o arquivo INI: backup do jogo não encontrado. Crie um backup do arquivo ISO original do jogo.

# gameBackupNotFoundTitle
source: Game backup not found
pt: Backup do jogo não encontrado

# iniNotFound
source: Unable to import INI: INI file not found at {0}
pt: Não foi possível importar INI: arquivo INI não encontrado em {0}

# dolphinUserFolderNotFoundLabel
source: Dolphin user folder not found on set path.
pt: Pasta de usuário do Dolphin não encontrada no caminho definido.

# zipModText
source: &Zip Mod...
pt: Criar &zip do mod...

source: No update available
pt: Nenhuma atualização disponível
